experiments/results/minperf_kda_s96_20260822/arm_kda_padded_N40_S96.log
[launch] backend=kda mode=padded N=40 distinct=184 ckpt=161 wmax=16 ragged=0 reqs=184 -> /home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/server_kda_padded_N40_w16_ckpt161_recon0.log
[wait] server pid=4050338 warming up...
[ready] after 70s
[capacity] backend=kda mode=padded cap=1.69x bytes/slot=12456960 slots=161 ckpt_HBM=1912.7MB (avg of 2 TP ranks) ([2026-08-22 12:51:19 TP0] head-aware mamba checkpoint pool (route A): plan built, bytes/slot=12984320 vs dense 20971520 (1.62x capacity); 2.07GB over 161 slots)
[flush]
[warm] backend=kda mode=padded
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31007/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 234443
#Output tokens: 11776
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 184/184 [00:11<00:00, 15.41it/s]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang
Traffic request rate:                    inf
Max request concurrency:                 16
Successful requests:                     184
Benchmark duration (s):                  11.95
Total input tokens:                      234443
Total input text tokens:                 234443
Total generated tokens:                  11776
Total generated tokens (retokenized):    11295
Request throughput (req/s):              15.40
Input token throughput (tok/s):          19620.36
Output token throughput (tok/s):         985.52
Peak output token throughput (tok/s):    1296.00
Peak concurrent requests:                32
Total token throughput (tok/s):          20605.89
Concurrency:                             15.50
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1006.53
Median E2E Latency (ms):                 966.05
P90 E2E Latency (ms):                    1208.67
P95 E2E Latency (ms):                    1323.67
P99 E2E Latency (ms):                    1325.04
---------------Time to First Token----------------
Mean TTFT (ms):                          301.48
Median TTFT (ms):                        260.73
P90 TTFT (ms):                           509.57
P95 TTFT (ms):                           594.21
P99 TTFT (ms):                           784.61
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.19
Median TPOT (ms):                        11.07
P90 TPOT (ms):                           13.99
P95 TPOT (ms):                           15.14
P99 TPOT (ms):                           17.72
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.19
Median ITL (ms):                         8.15
P90 ITL (ms):                            8.52
P95 ITL (ms):                            8.84
P99 ITL (ms):                            109.44
Max ITL (ms):                            699.73
==================================================
[measure] backend=kda mode=padded seed=42
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/result_kda_padded_N40_w16_ckpt161_recon0_seed42.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31007/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/result_kda_padded_N40_w16_ckpt161_recon0_seed42.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 234443
#Output tokens: 11776
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 184/184 [00:10<00:00, 17.47it/s]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang
Traffic request rate:                    inf
Max request concurrency:                 16
Successful requests:                     184
Benchmark duration (s):                  10.54
Total input tokens:                      234443
Total input text tokens:                 234443
Total generated tokens:                  11776
Total generated tokens (retokenized):    11352
Request throughput (req/s):              17.46
Input token throughput (tok/s):          22240.62
Output token throughput (tok/s):         1117.14
Peak output token throughput (tok/s):    1440.00
Peak concurrent requests:                39
Total token throughput (tok/s):          23357.76
Concurrency:                             15.45
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   885.06
Median E2E Latency (ms):                 871.33
P90 E2E Latency (ms):                    954.43
P95 E2E Latency (ms):                    1296.81
P99 E2E Latency (ms):                    1298.06
---------------Time to First Token----------------
Mean TTFT (ms):                          252.59
Median TTFT (ms):                        241.85
P90 TTFT (ms):                           414.97
P95 TTFT (ms):                           526.66
P99 TTFT (ms):                           761.39
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          10.04
Median TPOT (ms):                        9.84
P90 TPOT (ms):                           12.39
P95 TPOT (ms):                           12.45
P99 TPOT (ms):                           13.75
---------------Inter-Token Latency----------------
Mean ITL (ms):                           10.04
Median ITL (ms):                         8.14
P90 ITL (ms):                            8.43
P95 ITL (ms):                            8.61
P99 ITL (ms):                            84.45
Max ITL (ms):                            352.23
==================================================
[hit] backend=kda mode=padded seed=42 cached=170908 new=64562 token_hit_rate=0.7258
[result] kda/padded N40 seed=42: hit=0.7258 ttft_mean=252.6 p50=241.8 p95=526.7 p99=761.4 thr=1117.1 e2e=885.1 in_tok=234443 ckpt=161 HBM=1912.7MB cap=1.69x peak=NA recon_hits=NA replay_mean=NA
[done] backend=kda mode=padded (seeds=42) -> /home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/result_kda_padded_N40_w16_ckpt161_recon0_seed*.json